In [1]:
pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
     ---------------------------------------- 45.0/45.0 kB 1.1 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1
Note: you may need to restart the kernel to use updated packages.

In [2]:
from sqlalchemy import create_engine
import pymysql
import pandas as pd

# Credentials to database connection
hostname="localhost"
dbname="ik"
uname="root"
pwd="redhat"

# Create dataframe
a=list(map(int,input("Enter the Student_Id: ").split()))
b=input("Enter the Student Name:").split()
c=list(map(int,input("Enter the Student Age: ").split()))
d=input("Enter the Student Course Name:").split()
e=input("Enter the Student Address:").split()
Student_data = {"Student_Id":a,"Student_Name":b,"Student_Age":c,"Course_Name":d,"Student_Address":e};

df = pd.DataFrame(Student_data)

# Create SQLAlchemy engine to connect to MySQL Database
engine = create_engine("mysql+pymysql://{user}:{pw}@{host}/{db}"
				.format(host=hostname, db=dbname, user=uname, pw=pwd))

# Convert dataframe to sql table                                   
df.to_sql('student', engine, index=False)

Enter the Student_Id: 101 102 103 104 105 106 107 108 109 110
Enter the Student Name:Mukesh Ajay Saloni Geeta Renu Seeta Mahesh Rahul Ram Sanjay
Enter the Student Age: 22 23 24 26 21 22 23 24 21 20
Enter the Student Course Name:Devops C C++ Java Python R PHP DS DA WebDevelopemnt
Enter the Student Address:Jaipur Kota Ajmer Delhi Bikaner Rewari Jaipur Delhi Dausa Bundi

10

In [ ]:
101 102 103 104 105 106 107 108 109 110
Enter the Student Name:Mukesh Ajay Saloni Geeta Renu Seeta Mahesh Rahul Ram Sanjay
Enter the Student Age: 22 23 24 26 21 22 23 24 21 20
Enter the Student Course Name:Devops C C++ Java Python R PHP DS DA WebDevelopemnt
Enter the Student Address:Jaipur Kota Ajmer Delhi Bikaner Rewari Jaipur Delhi Dausa Bundi

# Reading data from MySQL to Pandas Dataframe

In [3]:
from sqlalchemy import create_engine
import pandas as pd


hostname="localhost"
dbname="ik"
uname="root"
pwd="redhat"
tablename="student"

engine = create_engine("mysql+pymysql://{user}:{pw}@{host}/{db}"
                           .format(host=hostname, db=dbname,
                                   user=uname,pw=pwd))
df = pd.read_sql(tablename, engine)
print(df.head(10))
a=df["Student_Name"][6]
print(a)

   Student_Id Student_Name  Student_Age     Course_Name Student_Address
0         101       Mukesh           22          Devops          Jaipur
1         102         Ajay           23               C            Kota
2         103       Saloni           24             C++           Ajmer
3         104        Geeta           26            Java           Delhi
4         105         Renu           21          Python         Bikaner
5         106        Seeta           22               R          Rewari
6         107       Mahesh           23             PHP          Jaipur
7         108        Rahul           24              DS           Delhi
8         109          Ram           21              DA           Dausa
9         110       Sanjay           20  WebDevelopemnt           Bundi
Mahesh